Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: note For ease of understanding, the examples throughout this chapter show full data structures for roots, graph and paths.
ja: メモ 理解を容易にするために、本章の例では、根、グラフ、の各パスの完全なデータ構造を示している。

source: note When writing an error message, it is preferred to make the first word lowercase.
ja: メモ エラー・メッセージを書き込む場合は、最初のワード小文字を小文字にすることをお勧めします。

source: note You only need to read this chapter if you want to understand the technical details of package loading.
ja: メモ パッケージのロードに関する技術的な詳細を理解するには、この章を読む必要があります。

source: option will search through parent directories until a Project.toml or JuliaProject.toml file is found.
ja: オプションは、Project.toml またはJuliaProject.tomlファイルが見つかるまで、親ディレクトリを検索します。

source: or else
ja: または

source: p, q and n from the enclosing scope.
ja: p、q、およびnを囲むスコープからの値。

source: p, q and n from the enclosing scope. Captured variables can present performance challenges; see (@ref man-performance-tips).
ja: p、q、およびnを囲むスコープからの値。 キャプチャされた変数はパフォーマンス上の問題を提示することがあります。 (@ref manのパフォーマンス・ヒント)。

source: parametric type instantiation
ja: パラメトリック・タイプのインスタンス化

source: performs addition
ja: 加算を行う

source: performs division
ja: 除算を行う

source: performs multiplication
ja: 乗算を行う

source: performs subtraction
ja: 減算を行う

source: positive infinity
ja: 正の無限大

source: power
ja: 冪乗

source: prefix "not" (logical negation) operator
ja: 接頭語"not"(論理否定)演算子

source: quoted expression
ja: 引用式

source: raises x to the yth power
ja: xをy乗する

source: range of n linearly spaced elements from start to stop
ja: nの範囲で、開始からまでの直線的に間隔をあけた要素の範囲

source: remainder
ja: 剰余

source: remainder operator
ja: 剰余演算子

source: remainder; satisfies x == div(x,y)*y + rem(x,y); sign matches x
ja: 余り； x == div(x,y)*y + rem(x,y)を満たす；符号は x と一致

source: returns (div(x,y),rem(x,y))
ja: (div(x,y),rem(x,y)) を返す

source: returns (fld(x,y),mod(x,y))
ja: (fld(x,y),mod(x,y))< を返す

source: round x to the nearest integer
ja: x を最も近い整数になるように丸める

source: round x towards +Inf
ja: x を +Inf に向かって丸める

source: round x towards -Inf
ja: x を -Inf に向かって丸める

source: round x towards zero
ja: x を0に向かって丸める

source: s, the sequence of characters returned when errors aren't thrown is the sequence of characters comprising the string s.
ja: s にインデックスする場合、エラーが出力されなければ文字列 s を構成する一連の文字列が返されます。

source: separate function arguments or tuple components
ja: 個別の関数の引数またはタプル・コンポーネント

source: short-circuiting boolean and
ja: 短絡ブール値

source: short-circuiting boolean or
ja: 短絡ブール値

source: shorthand for cat(A...; dims=1)
ja: cat(A.…;dims=1)の短縮形

source: shorthand for cat(A...; dims=2)
ja: cat(A.…;dims=2)の短縮形

source: similar supports 1- and 2-argument forms, in most case you only need to specialize the 3-argument form.) For this to work it's important that SparseArray is mutable (supports setindex!).
ja: 同様のは1と2の引数をサポートします ほとんどの場合、3引数形式の特殊化のみが必要となります。)この場合、重要なのは、このフォームを使用することです。 SparseArrayは可変です(setindex!をサポートします)。

source: sin.(a) to vectorize via broadcast.
ja: sin.(a)ブロードキャストを介してベクトル化するブロードキャスト<x/>。

source: sort function.
ja: sort関数です。

source: splice arguments into a function call or declare a varargs function
ja: 関数呼び出しに引数を指定するか、またはvarargs関数を宣言します。

source: square root of x
ja: xの平方根

source: statement separator
ja: 文区切り文字

source: stdcall is unified with the C calling convention).
ja: stdcallは C呼び出し規約)。

source: string and expression interpolation
ja: 文字列と式の補間

source: struct MyStyle <: Broadcast.BroadcastStyle end Base.BroadcastStyle(::Type{<:MyType}) = MyStyle()
ja: struct MyStyle<:Broadcast.BroadcastStyle end#struct MyStyle<:Broadcast.Schedule end# Base.BroadcastStyle(::Type{<:MyType})=MyStyle()

source: struct T (including typedef to a struct)
ja: struct T(構造体に対してtypedefを含む)

source: the bar function solves a problem that is better solved with multiple dispatch - defining bar(x) = x
ja: bar関数は、複数のディスパッチによって解決される問題を解決します。bar(x)=xを定義します。

source: the baz function is pathological
ja: baz関数は病的である

source: the foo function has side-effects (the call to Core.println), and it is undefined exactly when, how often or how many times these side-effects will occur
ja: foo関数は副作用(Core.printlnの呼び出し)を持っており、厳密には定義されていません。 これらの副作用が何回、何回発生するか、何回起こるか

source: the empty tuple
ja: 空のタプル

source: the expression arguments, which may be symbols, other expressions, or literal values:
ja: 式引数はシンボル、その他の式、またはリテラル値であることができます。

source: the identity operation
ja: 恒等演算

source: the number of dimensions of A
ja: Aの次元数

source: the number of elements in A
ja: Aのエレメント数

source: the size of A along dimension n
ja: nの寸法に沿ってAの大きさ

source: the squared magnitude of x
ja: x の大きさの２乗

source: the stride (linear index distance between adjacent elements) along dimension k
ja: 寸法kに沿っての歩幅(隣接する要素間の線形指数の距離)

source: the type of the elements contained in A
ja: Aに含まれるエレメントのタイプ

source: then the result of both f() and f(1,2) is -3.
ja: f()とf(1,2)の結果は両方とも-3です。言い換えれば、オプション引数は、その関数の特定のメソッドではなく、関数自体に結び付けられます。オプション引数の型によって、どのメソッドが呼び出されるかが変わります。オプション引数がグローバル変数で定義されている場合、オプション引数の型は実行時に変更されることさえあります。

source: this argument may be declared as Ptr{Cvoid}, if it really is just an unknown pointer
ja: この引数は、実際には未知のポインタである場合、Ptr{Cvoid}として宣言されることがあります。

source: times
ja: 乗算

source: translates to the following three methods:
ja: これは以下の3つのメソッドに変換されます。

source: truncated division; quotient rounded towards zero
ja: 整商; 0に向かって丸めた商

source: type annotation or `typeassert`, depending on context
ja: コンテキストに応じて、タイプの注釈または`テーペアセルト'を入力します。

source: unary minus
ja: 単項マイナス

source: unary plus
ja: 単項プラス

source: vector literal constructor (calling (@ref Base.vect))
ja: ベクトルリテラルコンストラクタ(calling(@ref Base.vect))

source: vertical concatenation (calling `vcat` or `hvcat`)
ja: 垂直連結(calling`vcat'or`ホフカト')

source: warning A return type of Union{} means the function will not return i.e. C++11 [[noreturn]] or C11 _Noreturn (e.g. jl_throw or longjmp).
ja: 警告 Union{}の戻り型は、関数がi.すなわちC++11[noreturn]またはC11を返すことはないことを意味します。 _Noreturn(例:jl_throwまたはlongjmp)。

source: warning For string arguments (char*) the Julia type should be Cstring (if NUL- terminated data is expected) or either Ptr{Cchar} or Ptr{UInt8} otherwise (these two pointer types have the same effect), as described above, not String.
ja: 警告 文字列引数(char*)では、Julia型はCstring(NUL-terminated dataがある場合)を指定する必要があります。 期待されるか、またはPtr{Cchar}またはPtr{UInt8}それ以外の場合(これらの2つのポインタタイプは同じですが、これらのポインタは同じです)。 上述のように、効果はStringではありません。

source: warning Fortran compilers may also add other hidden arguments for pointers, assumed-shape (:) and assumed-size (*) arrays.
ja: 警告 Fortranコンパイラはまた、ポインタに対して他の隠れた引数を追加することができます(:)。 そして、サイズは(*)であると考えられる。

source: warning Julia's Char type is 32 bits, which is not the same as the wide character type (wchar_t or wint_t) on all platforms.
ja: 警告 JuliaのChar型は32ビットで、ワイド文字タイプ(wchar_tまたは すべてのプラットフォームで、wint_t)。

source: warning Rounding is generally only correct for basic arithmetic functions (`+()`, `-()`, `*()`, `/()` and `sqrt()`) and type conversion operations.
ja: warning 端数処理は通常基本的な算術関数（`+()`、`-()`,、`*()`、`/()`、`sqrt()`）および 型変換処理においてのみ正常に機能します。

source: where Style12 is the BroadcastStyle you want to choose for outputs involving arguments of Style1 and Style2.
ja: ここで、Style12は、出力を選択するBroadcastStyleである。 Style1およびStyle2の引数。

source: where each I_k may be a scalar integer, an array of integers, or any other (@ref man-supported-index-types).
ja: ここで、各I_kはスカラー整数、整数の配列、またはその他のいずれかである。 (@ref man-supported-index-types)。

source: where each I_k may be a scalar integer, an array of integers, or any other (@ref man-supported-index-types). This includes `Colon` (:) to select all indices within the entire dimension, ranges of the form a:c or a:b:c to select contiguous or strided subsections, and arrays of booleans to select elements at their true indices.
ja: ここで、各I_kはスカラー整数、整数の配列、またはその他のいずれかである。 (@ref manサポートされているインデックス・タイプ)。これには、以下のものが含まれます。 「コロン」(:)は、次元全体のすべてのインデックスを選択するために使用されます。 a:cまたはa:b:cto select連続またはストライドされたものを選択するための範囲 サブセクションは、真のインデックスで選択要素を選択するためのブール演算の配列です。

source: which shows that f has two methods, one taking two Float64 arguments and one taking arguments of type Number.
ja: すると表示されるのは、fが二つのメソッドを持っていて、一方は2つのFloat64の引数を取り、他方は型がNumberの引数を取ることです。

source: while loop is first reached, the body is never evaluated.
ja: 一方、ループは最初に到達し、ボディは評価されません。

source: will behave as if the following were written:
ja: 次のような動作をします。

source: will contain a literal newline at the beginning.
ja: これは最初にリテラル改行を含みます。

source: with space-separated expressions, horizontal concatenation (calling `hcat` or `hvcat`)
ja: 空間的に分離された表現で、水平連結(calling`ヘカト'または'ホフカト'')

source: would be called only when the number of indexes matches the dimensionality of the array.
ja: indexesの数が配列の次元の数と一致する場合にのみ呼び出されます。

source: x % T converts an integer x to a value of integer type T congruent to x modulo 2^n, where n is the number of bits in T.
ja: x % T は、整数 x を、 x を法とする2^n （ n は Tのビット数）に一致する整数型 T の値に変換します。

source: x .+ 3 .* x.^2 are equivalent to nested dot calls (+).(x, (*).(3, (^).(x, 2))).
ja: x.+3.*x.^2は次のとおりです。 ネストされたドット呼び出し(+)(x,(*).(3,(^).(x, 2)).()).

source: x / y, truncated to an integer
ja: x/y、整数に切り捨てられます

source: x*2^n computed efficiently for integer values of n
ja: 整数値n に対して効率的に計算された x*2^n の値

source: x and y are identical
ja: x と y は等価か

source: x and y, avoiding overflow:
ja: けれども、実行順序を制御する場合、returnは役に立ちます。 例えば、直角三角形の斜辺を、その他の二辺 x ,yから、桁あふれをさけながら、計算する場合を考えてみましょう。xとyはオーバーフローを回避します。

source: x is a finite number
ja: x は有限数であるか

source: x is infinite
ja: x は無限であるか

source: x is not a number
ja: x は非数字か

source: ⊘ to complex integral values creates an instance of Complex{OurRational} -- a complex number whose real and imaginary parts are rationals:
ja: θから複雑な積分値は、Complex{OurRational}のインスタンスを生成する。 実部と虚部が合理的である数
